FO/apps/ITAFRONTOFFICE/lib/itaPHPInfor/test/InserisciPartenzaDestinatari.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nsjp="http://webservices.jprotocollo.jente.infor.arezzo.it/">
    <SOAP-ENV:Body>
        <nsjp:inserisciPartenza>
            <richiestaProtocollaPartenza>
                <nsjp:username xsi:type="xsd:string">a</nsjp:username>
                <nsjp:protocollaPartenza>
                    <nsjp:soggetti>
                        <nsjp:soggetto>
                            <nsjp:denominazione xsi:type="xsd:string">A.S.L. DI MILANO-ASL DI MILANO</nsjp:denominazione>
                            <nsjp:indirizzo xsi:type="xsd:string">Corso Italia, 19 20122 Milano MI</nsjp:indirizzo>
                        </nsjp:soggetto>
                        <nsjp:altriSoggetti xsi:type="SOAP-ENC:Array" SOAP-ENC:arrayType="unnamed_struct_use_soapval[1]">
                            <item>
                                <nsjp:soggetto>
                                    <nsjp:denominazione xsi:type="xsd:string">AGENZIA PER LA MOBILITA&apos; METROPOLITANA E REGIONALE</nsjp:denominazione>
                                    <nsjp:indirizzo xsi:type="xsd:string">Via Belfiore 23/C 10125 Torino TO</nsjp:indirizzo>
                                </nsjp:soggetto>
                            </item>
                        </nsjp:altriSoggetti>
                    </nsjp:soggetti>
                    <nsjp:oggetto xsi:type="xsd:string">Partenza....Oggetto comunicazione partenza. Denominazione Impresa: . Descrizione del passo: dasdasaadasda COMUNE: </nsjp:oggetto>
                    <nsjp:smistamenti>
                        <nsjp:smistamento>
                            <nsjp:corrispondente>
                                <nsjp:codice xsi:type="xsd:string">b</nsjp:codice>
                            </nsjp:corrispondente>
                        </nsjp:smistamento>
                    </nsjp:smistamenti>
                    <nsjp:classificazione>
                        <titolario xsi:type="xsd:string">1.2</titolario>
                    </nsjp:classificazione>
                </nsjp:protocollaPartenza>
                <nsjp:confermaSegnatura xsi:type="xsd:boolean">1</nsjp:confermaSegnatura>
            </richiestaProtocollaPartenza>
        </nsjp:inserisciPartenza>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>