FO/apps/ITAFRONTOFFICE/lib/itaPHPInfor/test/InserisciInterno.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.jprotocollo.jente.infor.arezzo.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:inserisciInterno>
         <!--Optional:-->
         <richiestaProtocollaInterno>
            <web:username>?</web:username>
            <web:protocollaInterno>
               <!--Optional:-->
               <web:registro>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:registro>
               <!--Optional:-->
               <web:sezione>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:sezione>
               <!--Optional:-->
               <web:corrispondente>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:corrispondente>
               <!--Optional:-->
               <web:mittenteInterno>
                  <web:corrispondente>
                     <web:codice>?</web:codice>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:corrispondente>
               </web:mittenteInterno>
               <web:smistamenti>
                  <!--Zero or more repetitions:-->
                  <web:smistamento>
                     <web:corrispondente>
                        <web:codice>?</web:codice>
                        <!--Optional:-->
                        <web:descrizione>?</web:descrizione>
                     </web:corrispondente>
                     <!--Optional:-->
                     <web:nota>?</web:nota>
                     <!--Optional:-->
                     <web:presaInCarico>?</web:presaInCarico>
                     <!--Optional:-->
                     <web:chiusura>?</web:chiusura>
                  </web:smistamento>
               </web:smistamenti>
               <web:oggetto>?</web:oggetto>
               <!--Optional:-->
               <web:classificazione>
                  <web:titolario>?</web:titolario>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
                  <!--Optional:-->
                  <web:fascicolo>
                     <web:anno>?</web:anno>
                     <web:numero>?</web:numero>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:fascicolo>
               </web:classificazione>
               <!--Optional:-->
               <web:dataInvio>?</web:dataInvio>
               <!--Optional:-->
               <web:estremi>
                  <!--Optional:-->
                  <web:data>?</web:data>
                  <!--Optional:-->
                  <web:numero>?</web:numero>
                  <!--Optional:-->
                  <web:importo>?</web:importo>
                  <!--Optional:-->
                  <web:allegati>?</web:allegati>
               </web:estremi>
               <!--Optional:-->
               <web:anteatto>
                  <!--Optional:-->
                  <web:registro>
                     <web:codice>?</web:codice>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:registro>
                  <web:anno>?</web:anno>
                  <web:numero>?</web:numero>
               </web:anteatto>
               <!--Optional:-->
               <web:altriDati>
                  <!--Optional:-->
                  <web:tipoDocumento>
                     <web:codice>?</web:codice>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:tipoDocumento>
                  <!--Optional:-->
                  <web:tramite>
                     <web:codice>?</web:codice>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:tramite>
                  <!--Optional:-->
                  <web:note>?</web:note>
                  <!--Optional:-->
                  <web:attributo1>?</web:attributo1>
                  <!--Optional:-->
                  <web:attributo2>?</web:attributo2>
                  <!--Optional:-->
                  <web:affare>
                     <web:codice>?</web:codice>
                     <!--Optional:-->
                     <web:descrizione>?</web:descrizione>
                  </web:affare>
                  <!--Optional:-->
                  <web:visibilita>?</web:visibilita>
               </web:altriDati>
            </web:protocollaInterno>
            <!--Optional:-->
            <web:documento>
               <web:titolo>?</web:titolo>
               <!--Optional:-->
               <web:volume>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:volume>
               <!--Optional:-->
               <web:formato>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:formato>
               <web:nomeFile>?</web:nomeFile>
               <!--Optional:-->
               <web:file>cid:1307256187828</web:file>
               <!--Optional:-->
               <web:progressivo>?</web:progressivo>
            </web:documento>
            <!--Optional:-->
            <web:confermaSegnatura>?</web:confermaSegnatura>
         </richiestaProtocollaInterno>
      </web:inserisciInterno>
   </soapenv:Body>
</soapenv:Envelope>