FO/apps/ITAFRONTOFFICE/lib/itaPHPInfor/test/InserisciArrivo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.jprotocollo.jente.infor.arezzo.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:inserisciArrivo>
         <!--Optional:-->
         <richiestaProtocollaArrivo>
            <!--type: string-->
            <web:username>gero et</web:username>
            <web:protocollaArrivo>
               <!--Optional:-->
               <web:registro>
                  <!--type: string-->
                  <web:codice>sonoras imperio</web:codice>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>quae divum incedo</web:descrizione>
               </web:registro>
               <!--Optional:-->
               <web:sezione>
                  <!--type: string-->
                  <web:codice>verrantque per auras</web:codice>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>per auras</web:descrizione>
               </web:sezione>
               <!--Optional:-->
               <web:corrispondente>
                  <!--type: string-->
                  <web:codice>circum claustra</web:codice>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>nimborum in</web:descrizione>
               </web:corrispondente>
               <web:soggetti>
                  <!--You have a CHOICE of the next 3 items at this level-->
                  <web:anagrafica>
                     <!--type: string-->
                     <web:codice>foedere certo</web:codice>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:denominazione>profundum quippe ferant</web:denominazione>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:indirizzo>et carcere</web:indirizzo>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:email>iovis rapidum iaculata</web:email>
                  </web:anagrafica>
                  <web:amministrazione>
                     <web:ente>
                        <!--type: string-->
                        <web:codice>speluncis abdidit</web:codice>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:descrizione>bella gero et</web:descrizione>
                     </web:ente>
                     <!--Optional:-->
                     <web:aoo>
                        <!--type: string-->
                        <web:codice>flammas turbine</web:codice>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:descrizione>hoc metuens</web:descrizione>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:email>ac vinclis</web:email>
                     </web:aoo>
                     <!--Optional:-->
                     <web:uo>
                        <!--type: string-->
                        <web:codice>speluncis abdidit</web:codice>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:descrizione>aris imponet honorem</web:descrizione>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:email>praeterea aut</web:email>
                     </web:uo>
                  </web:amministrazione>
                  <web:soggetto>
                     <!--type: string-->
                     <web:denominazione>claustra fremunt</web:denominazione>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:indirizzo>imperio premit</web:indirizzo>
                  </web:soggetto>
                  <!--Zero or more repetitions:-->
                  <web:altriSoggetti>
                     <!--Optional:-->
                     <web:soggetto>
                        <!--type: string-->
                        <web:denominazione>quisquam numen</web:denominazione>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:indirizzo>ac vinclis</web:indirizzo>
                     </web:soggetto>
                     <!--Optional:-->
                     <web:anagrafica>
                        <!--type: string-->
                        <web:codice>ac vinclis</web:codice>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:denominazione>pectore flammas</web:denominazione>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:indirizzo>pectore flammas</web:indirizzo>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:email>annos bella gero</web:email>
                     </web:anagrafica>
                     <!--Optional:-->
                     <web:amministrazione>
                        <web:ente>
                           <!--type: string-->
                           <web:codice>certo et</web:codice>
                           <!--Optional:-->
                           <!--type: string-->
                           <web:descrizione>rates evertitque aequora</web:descrizione>
                        </web:ente>
                        <!--Optional:-->
                        <web:aoo>
                           <!--type: string-->
                           <web:codice>volutans nimborum in</web:codice>
                           <!--Optional:-->
                           <!--type: string-->
                           <web:descrizione>faciat maria</web:descrizione>
                           <!--Optional:-->
                           <!--type: string-->
                           <web:email>et quisquam</web:email>
                        </web:aoo>
                        <!--Optional:-->
                        <web:uo>
                           <!--type: string-->
                           <web:codice>et soror</web:codice>
                           <!--Optional:-->
                           <!--type: string-->
                           <web:descrizione>annos bella gero</web:descrizione>
                           <!--Optional:-->
                           <!--type: string-->
                           <web:email>ventos tempestatesque sonoras</web:email>
                        </web:uo>
                     </web:amministrazione>
                  </web:altriSoggetti>
               </web:soggetti>
               <web:smistamenti>
                  <!--Zero or more repetitions:-->
                  <web:smistamento>
                     <web:corrispondente>
                        <!--type: string-->
                        <web:codice>regina iovisque</web:codice>
                        <!--Optional:-->
                        <!--type: string-->
                        <web:descrizione>rapidum iaculata</web:descrizione>
                     </web:corrispondente>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:nota>insuper altos</web:nota>
                     <!--Optional:-->
                     <!--type: boolean-->
                     <web:presaInCarico>true</web:presaInCarico>
                     <!--Optional:-->
                     <!--type: boolean-->
                     <web:chiusura>false</web:chiusura>
                  </web:smistamento>
               </web:smistamenti>
               <!--type: string-->
               <web:oggetto>in patriam</web:oggetto>
               <!--Optional:-->
               <web:classificazione>
                  <!--type: string-->
                  <web:titolario>abdidit atris hoc</web:titolario>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>coniunx una cum</web:descrizione>
                  <!--Optional:-->
                  <web:fascicolo>
                     <!--type: string-->
                     <web:anno>ipsa iovis</web:anno>
                     <!--type: string-->
                     <web:numero>frenat illi indignantes</web:numero>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:descrizione>nimborum in</web:descrizione>
                  </web:fascicolo>
               </web:classificazione>
               <!--Optional:-->
               <!--type: string-->
               <web:dataRicezione>mollitque animos</web:dataRicezione>
               <!--Optional:-->
               <web:estremi>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:data>montis insuper altos</web:data>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:numero>molemque et montis</web:numero>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:importo>gero et</web:importo>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:allegati>circum claustra fremunt</web:allegati>
               </web:estremi>
               <!--Optional:-->
               <web:anteatto>
                  <!--Optional:-->
                  <web:registro>
                     <!--type: string-->
                     <web:codice>montis insuper</web:codice>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:descrizione>aris imponet</web:descrizione>
                  </web:registro>
                  <!--type: string-->
                  <web:anno>aris imponet</web:anno>
                  <!--type: string-->
                  <web:numero>incedo regina</web:numero>
               </web:anteatto>
               <!--Optional:-->
               <web:altriDati>
                  <!--Optional:-->
                  <web:tipoDocumento>
                     <!--type: string-->
                     <web:codice>ac vinclis</web:codice>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:descrizione>acuto ast</web:descrizione>
                  </web:tipoDocumento>
                  <!--Optional:-->
                  <web:tramite>
                     <!--type: string-->
                     <web:codice>et premere et</web:codice>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:descrizione>dedit qui</web:descrizione>
                  </web:tramite>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:note>profundum quippe ferant</web:note>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:attributo1>imposuit regemque</web:attributo1>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:attributo2>magno cum</web:attributo2>
                  <!--Optional:-->
                  <web:affare>
                     <!--type: string-->
                     <web:codice>iras ni faciat</web:codice>
                     <!--Optional:-->
                     <!--type: string-->
                     <web:descrizione>verrantque per</web:descrizione>
                  </web:affare>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:visibilita>metuens molemque</web:visibilita>
               </web:altriDati>
            </web:protocollaArrivo>
            <!--Optional:-->
            <web:documento>
               <!--type: string-->
               <web:titolo>dare iussus habenas</web:titolo>
               <!--Optional:-->
               <web:volume>
                  <!--type: string-->
                  <web:codice>tempestatesque sonoras imperio</web:codice>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>sceptra tenens mollitque</web:descrizione>
               </web:volume>
               <!--Optional:-->
               <web:formato>
                  <!--type: string-->
                  <web:codice>vasto rex</web:codice>
                  <!--Optional:-->
                  <!--type: string-->
                  <web:descrizione>coniunx una cum</web:descrizione>
               </web:formato>
               <!--type: string-->
               <web:nomeFile>rapidum iaculata</web:nomeFile>
               <!--Optional:-->
               <!--type: base64Binary-->
               <web:file>cid:311883101688</web:file>
               <!--Optional:-->
               <!--type: integer-->
               <web:progressivo>100</web:progressivo>
            </web:documento>
            <!--Optional:-->
            <!--type: boolean-->
            <web:confermaSegnatura>false</web:confermaSegnatura>
         </richiestaProtocollaArrivo>
      </web:inserisciArrivo>
   </soapenv:Body>
</soapenv:Envelope>