FO/apps/ITAFRONTOFFICE/lib/itaPHPInfor/test/ConfermaSegnatura.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.jprotocollo.jente.infor.arezzo.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:confermaSegnatura>
         <!--Optional:-->
         <richiestaConfermaSegnatura>
            <web:username>?</web:username>
            <web:riferimento>
               <!--Optional:-->
               <web:registro>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:registro>
               <web:anno>?</web:anno>
               <web:numero>?</web:numero>
            </web:riferimento>
            <!--Optional:-->
            <web:documento>
               <web:titolo>?</web:titolo>
               <!--Optional:-->
               <web:volume>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:volume>
               <!--Optional:-->
               <web:formato>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:formato>
               <web:nomeFile>?</web:nomeFile>
               <!--Optional:-->
               <web:file>cid:1227405295080</web:file>
               <!--Optional:-->
               <web:progressivo>?</web:progressivo>
            </web:documento>
         </richiestaConfermaSegnatura>
      </web:confermaSegnatura>
   </soapenv:Body>
</soapenv:Envelope>