BO/lib/itaPHPInfor/test/InviaProtocollo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.jprotocollo.jente.infor.arezzo.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:inviaProtocollo>
         <!--Optional:-->
         <richiestaInviaProtocollo>
            <web:username>?</web:username>
            <web:riferimento>
               <!--Optional:-->
               <web:registro>
                  <web:codice>?</web:codice>
                  <!--Optional:-->
                  <web:descrizione>?</web:descrizione>
               </web:registro>
               <web:anno>?</web:anno>
               <web:numero>?</web:numero>
            </web:riferimento>
            <!--Optional:-->
            <web:account>?</web:account>
         </richiestaInviaProtocollo>
      </web:inviaProtocollo>
   </soapenv:Body>
</soapenv:Envelope>